In [56]:
import numpy as np
import matplotlib.pyplot as plt
import math
import pandas as pd
from numpy.random import randn,randint
np.random.seed(10)

In [4]:
labels = list
arr = np.array([10,20,30])

In [5]:
d = {"a": 10, "b": 20, "c": 30}

In [8]:
pd.Series(data=arr)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data=arr, index=labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series([5,6,7], index=["q","w","e"])

q    5
w    6
e    7
dtype: int64

In [14]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [17]:
a = pd.Series([1,3,7,9],["Computer","Monitor","Mouse","Keyboard"])

In [18]:
b = pd.Series([5,6,9,10],["Computer","Monitor","Mouse","Hard Disk"])

In [19]:
a+b

Computer      6.0
Hard Disk     NaN
Keyboard      NaN
Monitor       9.0
Mouse        16.0
dtype: float64

In [23]:
a["Computer":"Mouse"]

Computer    1
Monitor     3
Mouse       7
dtype: int64

In [27]:
for i in "abc":
    print(i)

a
b
c

In [33]:
pd.Series([10,20,30],"a b c".split())

a    10
b    20
c    30
dtype: int64

In [57]:
df = pd.DataFrame(randn(5,4), index="A B C D E".split(), 
                  columns="W X Y Z".split())

In [58]:
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [59]:
df["W"]

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [60]:
df["W"] + df["X"]

A    2.046865
B   -0.098750
C   -0.170309
D    0.063208
E   -1.001465
dtype: float64

In [61]:
df[["W","X"]]

          W         X
A  1.331587  0.715279
B  0.621336 -0.720086
C  0.004291 -0.174600
D -0.965066  1.028274
E -1.136602  0.135137

In [62]:
df.W

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [63]:
df["new"] = [3,7,9,10,12]

In [64]:
df

          W         X         Y         Z  new
A  1.331587  0.715279 -1.545400 -0.008384    3
B  0.621336 -0.720086  0.265512  0.108549    7
C  0.004291 -0.174600  0.433026  1.203037    9
D -0.965066  1.028274  0.228630  0.445138   10
E -1.136602  0.135137  1.484537 -1.079805   12

In [65]:
df["total"] = df["X"] + df["Z"]

In [66]:
df["W total new X Y Z".split()]

          W     total  new         X         Y         Z
A  1.331587  0.706895    3  0.715279 -1.545400 -0.008384
B  0.621336 -0.611537    7 -0.720086  0.265512  0.108549
C  0.004291  1.028437    9 -0.174600  0.433026  1.203037
D -0.965066  1.473412   10  1.028274  0.228630  0.445138
E -1.136602 -0.944668   12  0.135137  1.484537 -1.079805

In [69]:
type(df[["W","X"]])

pandas.core.frame.DataFrame

In [71]:
type(df[["W"]])

pandas.core.frame.DataFrame

In [73]:
df.drop("new",axis=1)

          W         X         Y         Z     total
A  1.331587  0.715279 -1.545400 -0.008384  0.706895
B  0.621336 -0.720086  0.265512  0.108549 -0.611537
C  0.004291 -0.174600  0.433026  1.203037  1.028437
D -0.965066  1.028274  0.228630  0.445138  1.473412
E -1.136602  0.135137  1.484537 -1.079805 -0.944668

In [74]:
df

          W         X         Y         Z  new     total
A  1.331587  0.715279 -1.545400 -0.008384    3  0.706895
B  0.621336 -0.720086  0.265512  0.108549    7 -0.611537
C  0.004291 -0.174600  0.433026  1.203037    9  1.028437
D -0.965066  1.028274  0.228630  0.445138   10  1.473412
E -1.136602  0.135137  1.484537 -1.079805   12 -0.944668

In [80]:
df.drop("Z",axis=1,inplace=True)

In [81]:
df

          W         X         Y     total
A  1.331587  0.715279 -1.545400  0.706895
B  0.621336 -0.720086  0.265512 -0.611537
C  0.004291 -0.174600  0.433026  1.028437
D -0.965066  1.028274  0.228630  1.473412
E -1.136602  0.135137  1.484537 -0.944668

In [77]:
df.drop("E")

          W         X         Y         Z     total
A  1.331587  0.715279 -1.545400 -0.008384  0.706895
B  0.621336 -0.720086  0.265512  0.108549 -0.611537
C  0.004291 -0.174600  0.433026  1.203037  1.028437
D -0.965066  1.028274  0.228630  0.445138  1.473412

In [82]:
df

          W         X         Y     total
A  1.331587  0.715279 -1.545400  0.706895
B  0.621336 -0.720086  0.265512 -0.611537
C  0.004291 -0.174600  0.433026  1.028437
D -0.965066  1.028274  0.228630  1.473412
E -1.136602  0.135137  1.484537 -0.944668

In [83]:
df.loc["C"]

W        0.004291
X       -0.174600
Y        0.433026
total    1.028437
Name: C, dtype: float64

In [84]:
type(df.loc["C"])

pandas.core.series.Series

In [85]:
df.iloc[2]

W        0.004291
X       -0.174600
Y        0.433026
total    1.028437
Name: C, dtype: float64

In [92]:
df.loc["B":"D",["X","Y"]]

          X         Y
B -0.720086  0.265512
C -0.174600  0.433026
D  1.028274  0.228630

In [89]:
df.iloc[1:3,2:4]

          Y     total
B  0.265512 -0.611537
C  0.433026  1.028437

In [93]:
df>0

       W      X      Y  total
A   True   True  False   True
B   True  False   True  False
C   True  False   True   True
D  False   True   True   True
E  False   True   True  False

In [94]:
df[df>0]

          W         X         Y     total
A  1.331587  0.715279       NaN  0.706895
B  0.621336       NaN  0.265512       NaN
C  0.004291       NaN  0.433026  1.028437
D       NaN  1.028274  0.228630  1.473412
E       NaN  0.135137  1.484537       NaN

In [100]:
df.loc["K"] = [1,2,3,6]

In [103]:
df

          W         X         Y     total
A  1.331587  0.715279 -1.545400  0.706895
B  1.000000  2.000000  3.000000  4.000000
C  0.004291 -0.174600  0.433026  1.028437
D -0.965066  1.028274  0.228630  1.473412
E -1.136602  0.135137  1.484537 -0.944668
F  1.000000  2.000000  3.000000  4.000000
Z  1.000000  2.000000  3.000000  9.000000
K  1.000000  2.000000  3.000000  6.000000

In [109]:
df.append(
    pd.DataFrame([[10,11,12,13]],index=["P"],
                 columns="W X Y total".split()))

           W          X          Y      total
A   1.331587   0.715279  -1.545400   0.706895
B   1.000000   2.000000   3.000000   4.000000
C   0.004291  -0.174600   0.433026   1.028437
D  -0.965066   1.028274   0.228630   1.473412
E  -1.136602   0.135137   1.484537  -0.944668
F   1.000000   2.000000   3.000000   4.000000
Z   1.000000   2.000000   3.000000   9.000000
K   1.000000   2.000000   3.000000   6.000000
P  10.000000  11.000000  12.000000  13.000000

In [106]:
df

          W         X         Y     total
A  1.331587  0.715279 -1.545400  0.706895
B  1.000000  2.000000  3.000000  4.000000
C  0.004291 -0.174600  0.433026  1.028437
D -0.965066  1.028274  0.228630  1.473412
E -1.136602  0.135137  1.484537 -0.944668
F  1.000000  2.000000  3.000000  4.000000
Z  1.000000  2.000000  3.000000  9.000000
K  1.000000  2.000000  3.000000  6.000000

In [117]:
(df["W"]>0) & (df["X"]>0)

A     True
B     True
C    False
D    False
E    False
F     True
Z     True
K     True
dtype: bool

In [118]:
(df["W"]>0) | (df["X"]>0)

A    True
B    True
C    True
D    True
E    True
F    True
Z    True
K    True
dtype: bool

In [123]:
u =

In [124]:
u

          W         X       Y     total
A  1.331587  0.715279 -1.5454  0.706895
B  1.000000  2.000000  3.0000  4.000000
F  1.000000  2.000000  3.0000  4.000000
Z  1.000000  2.000000  3.0000  9.000000
K  1.000000  2.000000  3.0000  6.000000

In [133]:
df[(df["W"]>0) & (df["X"]>0)].iloc[0:2]

          W         X       Y     total
A  1.331587  0.715279 -1.5454  0.706895
B  1.000000  2.000000  3.0000  4.000000

In [132]:
df[(df["W"]>0) & (df["X"]>0)].iloc[0]

W        1.331587
X        0.715279
Y       -1.545400
total    0.706895
Name: A, dtype: float64

In [128]:
type(df[(df["W"]>0) & (df["X"]>0)])

pandas.core.frame.DataFrame

In [137]:
df.reset_index(inplace=True)

In [138]:
df

  index         W         X         Y     total
0     A  1.331587  0.715279 -1.545400  0.706895
1     B  1.000000  2.000000  3.000000  4.000000
2     C  0.004291 -0.174600  0.433026  1.028437
3     D -0.965066  1.028274  0.228630  1.473412
4     E -1.136602  0.135137  1.484537 -0.944668
5     F  1.000000  2.000000  3.000000  4.000000
6     Z  1.000000  2.000000  3.000000  9.000000
7     K  1.000000  2.000000  3.000000  6.000000

In [146]:
df.index = list(df["index"])

In [148]:
df.drop("index",axis=1,inplace=True)

In [149]:
df

          W         X         Y     total
A  1.331587  0.715279 -1.545400  0.706895
B  1.000000  2.000000  3.000000  4.000000
C  0.004291 -0.174600  0.433026  1.028437
D -0.965066  1.028274  0.228630  1.473412
E -1.136602  0.135137  1.484537 -0.944668
F  1.000000  2.000000  3.000000  4.000000
Z  1.000000  2.000000  3.000000  9.000000
K  1.000000  2.000000  3.000000  6.000000